In [49]:
#Importando as bibliotecas necessárias
import pandas as pd
from datetime import datetime

#Função para ler o arquivo csv
def get_data(path):
    read_path = pd.read_csv(path)
    return read_path

#Reformatando o dtype das colunas
data = get_data('kc_house_data.csv')
data['date'] = pd.to_datetime(data['date']).dt.strftime('%d-%m-%Y')
data['bathrooms'] = round(data['bathrooms'] - 0.3)
data['floors'] = round(data['floors'] - 0.3)
data.head()

           id        date     price  bedrooms  bathrooms  ...  zipcode      lat     long  sqft_living15  sqft_lot15
0  7129300520  13-10-2014  221900.0         3        1.0  ...    98178  47.5112 -122.257           1340        5650
1  6414100192  09-12-2014  538000.0         3        2.0  ...    98125  47.7210 -122.319           1690        7639
2  5631500400  25-02-2015  180000.0         2        1.0  ...    98028  47.7379 -122.233           2720        8062
3  2487200875  09-12-2014  604000.0         4        3.0  ...    98136  47.5208 -122.393           1360        5000
4  1954400510  18-02-2015  510000.0         3        2.0  ...    98074  47.6168 -122.045           1800        7503

[5 rows x 21 columns]

In [48]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  object
 2   price          21613 non-null  float64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21611 non-null  float64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: float64(6), int64(14), object(1)
memory usage: 3.5+ MB